Config/Catalogs/ДрагМеталлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДрагМеталлы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДрагМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДрагМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ТипыДрагМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДрагМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеКамни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ДрагМеталлы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура НастроитьРазмещениеВГруппахПредопределенныхЭлементов() Экспорт
	НаименованиеГруппыДляАлмазовВИнструменте = НСтр("ru = 'Драгоценные камни в инструменте, порошках и пастах'");
	НаименованиеГруппыДрагКамней = НСтр("ru = 'Драгоценные камни'");
	НачалоНаименованияЭлементовДляАлмазовВИнструменте = НСтр("ru = 'АлмазыВИнструменте'");
	
	ГруппаДрагКамниВИнструментах = СозданиеГруппыДрагМатериалов(НаименованиеГруппыДляАлмазовВИнструменте);
	ГруппаДрагКамни = СозданиеГруппыДрагМатериалов(НаименованиеГруппыДрагКамней);
	
	//Создание новых групп
	Если НЕ ЗначениеЗаполнено(ГруппаДрагКамниВИнструментах) Тогда
		СпрГруппа = Справочники.ДрагМеталлы.СоздатьГруппу();
		СпрГруппа.Наименование = НаименованиеГруппыДляАлмазовВИнструменте;
		СпрГруппа.Записать();
		
		ГруппаДрагКамниВИнструментах = СпрГруппа.Ссылка; 
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ГруппаДрагКамни) Тогда
		СпрГруппа = Справочники.ДрагМеталлы.СоздатьГруппу();
		СпрГруппа.Наименование = НаименованиеГруппыДрагКамней;
		СпрГруппа.Записать();
		
		ГруппаДрагКамни = СпрГруппа.Ссылка; 
	КонецЕсли;	
	
	//Заполнение реквизитов
	МассивДрагКамней = УчетДрагМатериалов.МассивДрагКамней();
	
	Для Каждого ТекСтрока Из МассивДрагКамней Цикл
		Если Сред(Строка(ТекСтрока.ИмяПредопределенныхДанных),0,18) = НачалоНаименованияЭлементовДляАлмазовВИнструменте Тогда
			СпрОбъект = ТекСтрока.ПолучитьОбъект();
			СпрОбъект.Родитель = ГруппаДрагКамниВИнструментах;
			СпрОбъект.ТипДрагМатериала = Перечисления.ТипыДрагМатериалов.ДрагоценныеКамни;
			СпрОбъект.Записать();
		Иначе
			СпрОбъект = ТекСтрока.ПолучитьОбъект();
			СпрОбъект.Родитель = ГруппаДрагКамни;
			СпрОбъект.ТипДрагМатериала = Перечисления.ТипыДрагМатериалов.ДрагоценныеКамни;
			СпрОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;
	
	МассивДрагМеталлов = УчетДрагМатериалов.МассивДрагМеталлов();
	
	Для Каждого ТекСтрока Из МассивДрагМеталлов Цикл
		СпрОбъект = ТекСтрока.ПолучитьОбъект();
		СпрОбъект.ТипДрагМатериала = Перечисления.ТипыДрагМатериалов.ДрагоценныеМеталлы;
		СпрОбъект.Записать();
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СозданиеГруппыДрагМатериалов(НаименованиеГруппы) 
	Результат = Справочники.ДрагМеталлы.ПустаяСсылка();
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДрагМеталлы.Ссылка
	               |ИЗ
	               |	Справочник.ДрагМеталлы КАК ДрагМеталлы
	               |ГДЕ
	               |	ДрагМеталлы.ЭтоГруппа = ИСТИНА
	               |	И ДрагМеталлы.Наименование = &НаименованиеГруппы";
	Запрос.УстановитьПараметр("НаименованиеГруппы", НаименованиеГруппы);			   
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

#КонецОбласти
	
#КонецЕсли
